zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */


/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __STM32MP2xx_HAL_PWR_H
#define __STM32MP2xx_HAL_PWR_H


#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup PWR
  * @{
  */


/* Exported types ------------------------------------------------------------*/
/** @defgroup PWR_Exported_Types PWR Exported Types
  * @{
  */

/**
  * @brief  PWR PVD configuration structure definition
  */
typedef struct
{
  uint32_t Mode;      /*!< Mode: Specifies the operating mode for the selected pins.
                           This parameter can be a value of @ref PWR_EXTI_Mode */
} PWR_PVDTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup PWR_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_WAKEUP_PIN_ID PWR PWR WAKEUP PIN ID
  * @{
  */
#define PWR_WAKEUP_PIN_ID1              0U    /*!< Wakeup event on pin WKUP1 */
#define PWR_WAKEUP_PIN_ID2              1U    /*!< Wakeup event on pin WKUP2 */
#define PWR_WAKEUP_PIN_ID3              2U    /*!< Wakeup event on pin WKUP3 */
#define PWR_WAKEUP_PIN_ID4              3U    /*!< Wakeup event on pin WKUP4 */
#define PWR_WAKEUP_PIN_ID5              4U    /*!< Wakeup event on pin WKUP5 */
#define PWR_WAKEUP_PIN_ID6              5U    /*!< Wakeup event on pin WKUP6 */
#define PWR_WAKEUP_PIN_ID_POS           0U
#define PWR_WAKEUP_PIN_ID_SIZE          6U
#define PWR_WAKEUP_PIN_ID_MASK          (0x3FU << PWR_WAKEUP_PIN_ID_POS)

#define PWR_WAKEUP_HIGH                 0U    /* detection on rising edge */
#define PWR_WAKEUP_LOW                  1U    /* detection on falling edge */
#define PWR_WAKEUP_EDGE_POS             (PWR_WAKEUP_PIN_ID_POS + PWR_WAKEUP_PIN_ID_SIZE)
#define PWR_WAKEUP_EDGE_SIZE            1U
#define PWR_WAKEUP_EDGE_MASK            (1U << PWR_WAKEUP_EDGE_POS)


#define PWR_WAKEUP_NOPULL               0U    /* no pull setting */
#define PWR_WAKEUP_PULLUP               1U    /* pull up setting */
#define PWR_WAKEUP_PULLDOWN             2U    /* pull down setting */
#define PWR_WAKEUP_PULL_POS             (PWR_WAKEUP_EDGE_POS + PWR_WAKEUP_EDGE_SIZE)
#define PWR_WAKEUP_PULL_MASK            (3U << PWR_WAKEUP_PULL_POS)


/*legacy heritage*/
#define PWR_WAKEUP_PIN6_HIGH                 \
  (PWR_WAKEUP_PIN_ID6 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_HIGH << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN5_HIGH                 \
  (PWR_WAKEUP_PIN_ID5 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_HIGH << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN4_HIGH                 \
  (PWR_WAKEUP_PIN_ID4 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_HIGH << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN3_HIGH                 \
  (PWR_WAKEUP_PIN_ID3 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_HIGH << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN2_HIGH                 \
  (PWR_WAKEUP_PIN_ID2 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_HIGH << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN1_HIGH                 \
  (PWR_WAKEUP_PIN_ID1 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_HIGH << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)

#define PWR_WAKEUP_PIN6_LOW                 \
  (PWR_WAKEUP_PIN_ID6 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_LOW << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN5_LOW                 \
  (PWR_WAKEUP_PIN_ID5 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_LOW << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN4_LOW                 \
  (PWR_WAKEUP_PIN_ID4 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_LOW << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN3_LOW                 \
  (PWR_WAKEUP_PIN_ID3 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_LOW << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN2_LOW                 \
  (PWR_WAKEUP_PIN_ID2 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_LOW << PWR_WAKEUP_EDGE_POS) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)
#define PWR_WAKEUP_PIN1_LOW                 \
  (PWR_WAKEUP_PIN_ID1 << PWR_WAKEUP_PIN_ID_POS) | (PWR_WAKEUP_LOW << ) | \
  (PWR_WAKEUP_NOPULL << PWR_WAKEUP_PULL_POS)

#define PWR_WAKEUP_PIN6               PWR_WAKEUP_PIN6_HIGH
#define PWR_WAKEUP_PIN5               PWR_WAKEUP_PIN5_HIGH
#define PWR_WAKEUP_PIN4               PWR_WAKEUP_PIN4_HIGH
#define PWR_WAKEUP_PIN3               PWR_WAKEUP_PIN3_HIGH
#define PWR_WAKEUP_PIN2               PWR_WAKEUP_PIN2_HIGH
#define PWR_WAKEUP_PIN1               PWR_WAKEUP_PIN1_HIGH

#define IS_PWR_WAKEUP_PIN_EDGE(__EDGE__)  (((__EDGE__)  == PWR_WAKEUP_HIGH)        || \
                                           ((__EDGE__)  == PWR_WAKEUP_LOW)            )

#define IS_PWR_WAKEUP_PIN_CONFIG(__CFG__)  (((__CFG__) == PWR_WAKEUP_NOPULL)       || \
                                            ((__CFG__) == PWR_WAKEUP_PULLUP)       || \
                                            ((__CFG__) == PWR_WAKEUP_PULLDOWN)        )


#define IS_PWR_WAKEUP_PIN_ID(__VALUE__)            (((__VALUE__)  == PWR_WAKEUP_PIN_ID1)        || \
                                                    ((__VALUE__)  == PWR_WAKEUP_PIN_ID2)        || \
                                                    ((__VALUE__)  == PWR_WAKEUP_PIN_ID3)        || \
                                                    ((__VALUE__)  == PWR_WAKEUP_PIN_ID4)        || \
                                                    ((__VALUE__)  == PWR_WAKEUP_PIN_ID5)        || \
                                                    ((__VALUE__)  == PWR_WAKEUP_PIN_ID6)           )

/**
  * @}
  */

/** @defgroup PWR_EXTI_Mode PWR EXTI Mode
  * @{
  */
#define PWR_EXTI_MODE_NORMAL               ((uint32_t)0x00000000U)  /*!< Basic mode used, no interruption                                   */
#define PWR_EXTI_MODE_IT_RISING            ((uint32_t)0x00010001U)  /*!< External Interrupt Mode with Rising edge trigger detection         */
#define PWR_EXTI_MODE_IT_FALLING           ((uint32_t)0x00010002U)  /*!< External Interrupt Mode with Falling edge trigger detection        */
#define PWR_EXTI_MODE_IT_RISING_FALLING    ((uint32_t)0x00010003U)  /*!< External Interrupt Mode with Rising/Falling edge trigger detection */


#define IS_PWR_EXTI_MODE(MODE) (((MODE) == PWR_EXTI_MODE_IT_RISING)         || ((MODE) == PWR_EXTI_MODE_IT_FALLING) || \
                                ((MODE) == PWR_EXTI_MODE_IT_RISING_FALLING) || ((MODE) == PWR_EXTI_MODE_NORMAL) )

#define IS_AN_INTERRUPT_PWR_EXTI_MODE(MODE) (((MODE) == PWR_EXTI_MODE_IT_RISING)   || \
                                             ((MODE) == PWR_EXTI_MODE_IT_FALLING)  || \
                                             ((MODE) == PWR_EXTI_MODE_IT_RISING_FALLING)  )

#define PWR_PVD_MODE_NORMAL                              PWR_EXTI_MODE_NORMAL
#define PWR_PVD_MODE_IT_RISING                           PWR_EXTI_MODE_IT_RISING
#define PWR_PVD_MODE_IT_FALLING                          PWR_EXTI_MODE_IT_FALLING
#define PWR_PVD_MODE_IT_RISING_FALLING                   PWR_EXTI_MODE_IT_RISING_FALLING


#define IS_PWR_PVD_MODE(MODE) IS_PWR_EXTI_MODE(MODE)
#define IS_AN_INTERRUPT_PWR_PVD_MODE(MODE)  IS_AN_INTERRUPT_PWR_EXTI_MODE(MODE)
/**
  * @}
  */

/**
  * @brief  indicate voltage range where VDD is
  * @retval None
  */
#define PWR_VDD_BELOW_THRESHOLD                 1U
#define PWR_VDD_ABOVE_OR_EQUAL_THRESHOLD        2U
#define PWR_NO_VDD_MEASUREMENT_AVAILABLE        15U

/** @defgroup PWR_Access_filtering PWR Access filtering (non shareable then wio resource)
  * @{
  */
#define NS_RESOURCE_POS              0U

#define NON_SHAREABLE_RESSOURCE_0    (1U << (0U + NS_RESOURCE_POS))   /*!< non shareable Resource1 access control  */
#define NON_SHAREABLE_RESSOURCE_1    (1U << (1U + NS_RESOURCE_POS))   /*!< non shareable Resource2 access control  */
#define NON_SHAREABLE_RESSOURCE_2    (1U << (2U + NS_RESOURCE_POS))   /*!< non shareable Resource3 access control  */
#define NON_SHAREABLE_RESSOURCE_3    (1U << (3U + NS_RESOURCE_POS))   /*!< non shareable Resource4 access control  */
#define NON_SHAREABLE_RESSOURCE_4    (1U << (4U + NS_RESOURCE_POS))   /*!< non shareable Resource5 access control  */
#define NON_SHAREABLE_RESSOURCE_5    (1U << (5U + NS_RESOURCE_POS))   /*!< non shareable Resource5 access control  */
#define NON_SHAREABLE_RESSOURCE_6    (1U << (6U + NS_RESOURCE_POS))   /*!< non shareable Resource5 access control  */

#define NON_SHAREABLE_RESOURCE_NB    7U


