zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr.h
#define NS_RESOURCE_ATTR_PRIV_SELECT          0x01000000U
#define NS_RESOURCE_ATTR_SEC_SELECT           0x02000000U
#define NS_RESOURCE_ATTR_CID_STATIC_SELECT    0x20000000U
#define NS_RESOURCE_CID_DISABLE               0x80000000U

#define NS_RESOURCE_PRIV_VAL_POS             0
#define NS_RESOURCE_PRIV                     (NS_RESOURCE_ATTR_PRIV_SELECT | (1U<<NS_RESOURCE_PRIV_VAL_POS)) /*!< Resource is privileged   */
#define NS_RESOURCE_NPRIV                    (NS_RESOURCE_ATTR_PRIV_SELECT)                                  /*!< Resource is unprivileged */

#if defined (CORTEX_IN_SECURE_STATE)
#define NS_RESOURCE_SEC_VAL_POS              1
#define NS_RESOURCE_SEC                      (NS_RESOURCE_ATTR_SEC_SELECT | (1U<<NS_RESOURCE_SEC_VAL_POS)) /*!< Resource is secure       */
#define NS_RESOURCE_NSEC                     (NS_RESOURCE_ATTR_SEC_SELECT)                                 /*!< Resource is non-secure   */
#endif /* __ARM_SECURE_STATE */

#define NS_RESOURCE_CID_STATIC_0     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (0<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID0 */
#define NS_RESOURCE_CID_STATIC_1     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (1<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID1 */
#define NS_RESOURCE_CID_STATIC_2     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (2<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID2 */
#define NS_RESOURCE_CID_STATIC_3     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (3<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID3 */
#define NS_RESOURCE_CID_STATIC_4     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (4<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID4 */
#define NS_RESOURCE_CID_STATIC_5     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (5<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID5 */
#define NS_RESOURCE_CID_STATIC_6     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (6<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID6 */
#define NS_RESOURCE_CID_STATIC_7     (NS_RESOURCE_ATTR_CID_STATIC_SELECT | (7<<PWR_R0CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID7 */


#define WIO_RESOURCE_POS   NON_SHAREABLE_RESOURCE_NB

#define WIO_RESOURCE_0     (1UL << (0U + WIO_RESOURCE_POS))   /*!< shareable wake-up IO  Resource1 access control  */
#define WIO_RESOURCE_1     (1UL << (1U + WIO_RESOURCE_POS))   /*!< shareable wake-up IO  Resource2 access control  */
#define WIO_RESOURCE_2     (1UL << (2U + WIO_RESOURCE_POS))   /*!< shareable wake-up IO  Resource3 access control  */
#define WIO_RESOURCE_3     (1UL << (3U + WIO_RESOURCE_POS))   /*!< shareable wake-up IO  Resource4 access control  */
#define WIO_RESOURCE_4     (1UL << (4U + WIO_RESOURCE_POS))   /*!< shareable wake-up IO  Resource5 access control  */
#define WIO_RESOURCE_5     (1UL << (5U + WIO_RESOURCE_POS))   /*!< shareable wake-up IO  Resource5 access control  */


#define WIO_PIN_ATTR_PRIV_SELECT          0x01000000U
#define WIO_PIN_ATTR_SEC_SELECT           0x02000000U
#define WIO_PIN_ATTR_CID_SHARED_MASK      (PWR_WIO1CIDCFGR_SEMWLC0 | PWR_WIO1CIDCFGR_SEMWLC1 | \
                                           PWR_WIO1CIDCFGR_SEMWLC2 | PWR_WIO1CIDCFGR_SEMWLC3 | \
                                           PWR_WIO1CIDCFGR_SEMWLC4 | PWR_WIO1CIDCFGR_SEMWLC5 | \
                                           PWR_WIO1CIDCFGR_SEMWLC6 | PWR_WIO1CIDCFGR_SEMWLC7 )
#define WIO_PIN_ATTR_CID_SHARED_SELECT    0x10000000U
#define WIO_PIN_ATTR_CID_STATIC_SELECT    0x20000000U
#define WIO_PIN_CID_DISABLE               0x80000000U

#define WIO_PIN_PRIV_VAL_POS             0
#define WIO_PIN_PRIV                     (WIO_PIN_ATTR_PRIV_SELECT | (1U<<WIO_PIN_PRIV_VAL_POS))     /*!< Pin is privileged             */
#define WIO_PIN_NPRIV                    (WIO_PIN_ATTR_PRIV_SELECT)                                  /*!< Pin is unprivileged           */

#if defined (CORTEX_IN_SECURE_STATE)
#define WIO_PIN_SEC_VAL_POS              1
#define WIO_PIN_SEC                      (WIO_PIN_ATTR_SEC_SELECT | (1U<<WIO_PIN_SEC_VAL_POS))      /*!< Pin is secure                 */
#define WIO_PIN_NSEC                     (WIO_PIN_ATTR_SEC_SELECT)              /*!< Pin is non-secure             */
#endif /* __ARM_SECURE_STATE */

#define WIO_PIN_CID_STATIC_0        (WIO_PIN_ATTR_CID_STATIC_SELECT | (0<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID0 */
#define WIO_PIN_CID_STATIC_1        (WIO_PIN_ATTR_CID_STATIC_SELECT | (1<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID1 */
#define WIO_PIN_CID_STATIC_2        (WIO_PIN_ATTR_CID_STATIC_SELECT | (2<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID2 */
#define WIO_PIN_CID_STATIC_3        (WIO_PIN_ATTR_CID_STATIC_SELECT | (3<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID3 */
#define WIO_PIN_CID_STATIC_4        (WIO_PIN_ATTR_CID_STATIC_SELECT | (4<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID4 */
#define WIO_PIN_CID_STATIC_5        (WIO_PIN_ATTR_CID_STATIC_SELECT | (5<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID5 */
#define WIO_PIN_CID_STATIC_6        (WIO_PIN_ATTR_CID_STATIC_SELECT | (6<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID6 */
#define WIO_PIN_CID_STATIC_7        (WIO_PIN_ATTR_CID_STATIC_SELECT | (7<<PWR_WIO1CIDCFGR_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID7 */

#define WIO_PIN_CID_SHARED_0        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC0)      /*!< Enable CID filtering (shared mode) and give pin control  to CID0 */
#define WIO_PIN_CID_SHARED_1        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC1)      /*!< Enable CID filtering (shared mode) and give pin control  to CID1 */
#define WIO_PIN_CID_SHARED_2        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC2)      /*!< Enable CID filtering (shared mode) and give pin control  to CID2 */
#define WIO_PIN_CID_SHARED_3        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC3)      /*!< Enable CID filtering (shared mode) and give pin control  to CID3 */
#define WIO_PIN_CID_SHARED_4        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC4)      /*!< Enable CID filtering (shared mode) and give pin control  to CID4 */
#define WIO_PIN_CID_SHARED_5        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC5)      /*!< Enable CID filtering (shared mode) and give pin control  to CID5 */
#define WIO_PIN_CID_SHARED_6        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC6)      /*!< Enable CID filtering (shared mode) and give pin control  to CID6 */
#define WIO_PIN_CID_SHARED_7        (WIO_PIN_ATTR_CID_SHARED_SELECT | PWR_WIO1CIDCFGR_SEMWLC7)      /*!< Enable CID filtering (shared mode) and give pin control  to CID7 */

