zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr.h
#define SHAREABLE_RESOURCE_NB        6U
/**
  * @}
  */


/** @defgroup PWR_Regulator_state_in_STOP_mode PWR Regulator state in STOP_mode
  * @{
  */
#define PWR_REGULATOR_LP_OFF                        0UL
#define PWR_REGULATOR_LP_ON_LV_OFF                  1UL
#define PWR_REGULATOR_LP_ON_LV_ON                   3UL

#define IS_PWR_STOP_MODE_REGULATOR(__REGULATOR__)     (((__REGULATOR__) == PWR_REGULATOR_LP_OFF)  || \
                                                       ((__REGULATOR__) == PWR_REGULATOR_LP_ON_LV_OFF) || \
                                                       ((__REGULATOR__) == PWR_REGULATOR_LP_ON_LV_ON))
/**
  * @}
  */


/** @defgroup PWR_CPU_state PWR CPU state
  * @{
  */
#define PWR_CPU_CRUN                    1U
#define PWR_CPU_CSLEEP                  2U
#define PWR_CPU_CSTOP                   3U
#define PWR_CPU_CRESET                  0U
/**
  * @}
  */

/** @defgroup PWR_D1_state PWR D1 state
  * @{
  */
/* CPU1 is in CRUN or CSLEEP */
#define PWR_D1_DRUN                    0U
/* CPU1 is in CSTOP (D1 clock stalled) with no additional power saving request set */
#define PWR_D1_DSTOP1                  1U
/* CPU1 is in CSTOP (D1 clock stalled) with LPwr power saving request set */
#define PWR_D1_DSTOP2                  2U
/* CPU1 is in CSTOP (D1 clock stalled) with LPwr/LVoltage power saving request set*/
#define PWR_D1_DSTOP3                  3U
/* D1 is not powered */
#define PWR_D1_DSTANDBY                4U
/**
  * @}
  */

/** @defgroup PWR_D2_state PWR D2 state
  * @{
  */
/* CPU2 is CRUN or CSLEEP */
#define PWR_D2_RUN                     0U
/* CPU1/CPU2 are in CSTOP (D1/D2 clock stalled) with no additional power saving request set*/
#define PWR_D2_STOP                    1U
/* CPU1/CPU2 are in CSTOP (D1/D2 clock stalled) with no LPwr power saving request set*/
#define PWR_D2_LP_STOP                 2U
/* D1 not powered, CPU2 is in CSTOP (D2 clock stalled) with LPwr/LVotage power saving request set*/
#define PWR_D2_LPLVSTOP2               3U
/* D2/D1 not powered (D3 may be powered or not according to CPU3 activity)*/
#define PWR_D2_STANDBY                 4U
/* system is on VBAT */
#define PWR_D2_VBAT                    5U
/**
  * @}
  */

/** @defgroup PWR_D3_state PWR D3 state
  * @{
  */
#define PWR_D3_SRUN1                   0U   /* all CPUS are in CRUN or CSLEEP*/
#define PWR_D3_SRUN2                   1U   /* CPU3 is in CRUN or CSLEEP, D2 is in STOP  */
#define PWR_D3_SRUN3                   2U   /* CPU3 is in CRUN or CSLEEP, D2 is in STOP-LP or STOP-VP or standby*/
#define PWR_D3_SSTOP1                  3U   /* CPU3 is in CSTOP, D2 is in STOP  */
#define PWR_D3_SSTOP2                  4U   /* CPU3 is in CSTOP, D2 is in STOP-LP or STOP-LV or standby */
#define PWR_D3_SSTANDBY                5U   /* D3/D2/D1 domain are not powered */
/**
  * @}
  */


/** @defgroup PWR_SLEEP_mode_entry PWR SLEEP mode entry
  * @{
  */

#define PWR_SLEEPENTRY_WFI              ((uint8_t)0x01)
#define PWR_SLEEPENTRY_WFE              ((uint8_t)0x02)
#define IS_PWR_SLEEP_ENTRY(__ENTRY__)   (((__ENTRY__) == PWR_SLEEPENTRY_WFI) || ((__ENTRY__) == PWR_SLEEPENTRY_WFE))
/**
  * @}
  */


/** @defgroup PWR_STOP_mode_entry PWR STOP mode entry
  * @{
  */
#define PWR_STOPENTRY_WFI               ((uint8_t)0x01)
#define PWR_STOPENTRY_WFE               ((uint8_t)0x02)

#define IS_PWR_STOP_ENTRY(__ENTRY__)    (((__ENTRY__) == PWR_STOPENTRY_WFI) || ((__ENTRY__) == PWR_STOPENTRY_WFE))
/**
  * @}
  */

/** @defgroup PWR_STANDBYType PWR STANDBYType
  * @{
  */
#define PWR_STANDBY_1               ((uint8_t)0x01)
#define PWR_STANDBY_2               ((uint8_t)0x02)

#define IS_PWR_STANDBY_TYPE(__TYPE__)    (((__TYPE__) == PWR_STANDBY_1) || ((__TYPE__) == PWR_STANDBY_2))

/**
  * @}
  */

/** @defgroup PWR_SYSTEM_STANDBY_REQUEST  PWR SYSTEM STANDBY REQUEST
  * @{
  */

#ifdef CORE_CM0PLUS
#define  SYSTEM_STANDBY_FLAG                            PWR_CPU3CR_SBF_D3
#define  SYSTEM_STANDBY_REQUEST                         PWR_D3CR_PDDS_D3
#define  SYSTEM_STANDBY_FLAGS_CLEAR                     PWR_CPU3CR_CSSF
#endif /* CORE_CM0PLUS */
#ifdef CORE_CM33
#define  SYSTEM_STANDBY_FLAG                            PWR_CPU2CR_SBF
#define  SYSTEM_STANDBY_REQUEST                         PWR_CPU2CR_PDDS_D2
#define  SYSTEM_STANDBY_FLAGS_CLEAR                     PWR_CPU2CR_CSSF
#endif /* CORE_CM33 */
#ifdef CORE_CA35
#define  SYSTEM_STANDBY_FLAG                            PWR_CPU1CR_SBF
#define  SYSTEM_STANDBY_REQUEST                         PWR_CPU1CR_PDDS_D1
#define  DOMAIN2_STANDBY_REQUEST                        PWR_CPU1CR_PDDS_D2
#define  SYSTEM_STANDBY_FLAGS_CLEAR                     PWR_CPU1CR_CSSF
#endif /* CORE_CA35 */

/**
  * @}
  */


/** @defgroup PWR_Flag PWR Flag
  * @{
  */
#define PWR_FLAG_VDDGPURDY         (0x00U)   /* to check readiness of GPU power domain       */
#define PWR_FLAG_D3RDY             (0x01U)   /* to check readiness of D3 domain supply       */
#define PWR_FLAG_PVDO              (0x03U)   /* to check if VDD  is lower than PVD threshold */
#define PWR_FLAG_VBATL             (0x04U)   /* to check if VBAT is equal or lower  than VBAT low  threshold */
#define PWR_FLAG_VBATH             (0x05U)   /* to check if VBAT is equal or higher than VBAT high threshold */
#define PWR_FLAG_TEMPL             (0x06U)   /* to check if TEMP is equal or lower  than TEMP low  threshold */
#define PWR_FLAG_TEMPH             (0x07U)   /* to check if TEMP is equal or higher than TEMP high threshold */
#define PWR_FLAG_USB               (0x08U)   /* to check readiness of  USB supply */
#define PWR_FLAG_VDDCOREL          (0x09U)   /* to check if VDDcore is equal or lower than VDDcore low threshold */
#define PWR_FLAG_VDDCOREH          (0x0AU)   /* to check if VDDcore is equal or higher than VDDcore high threshold */
#define PWR_FLAG_VDDCPUL           (0x0BU)   /* to check if VDDcpu is equal or lower than VDDcpu low threshold */
#define PWR_FLAG_VDDCPUH           (0x0CU)   /* to check if VDDcpu is equal or higher than VDDcpu high threshold */
#define PWR_FLAG_VB                (0x0DU)   /* to check if system has been in VBAT mode */
#define PWR_FLAG_SB_D3             (0x0EU)   /* to check if D3 domain  has been in standby */
#define PWR_FLAG_SB_D2             (0x10U)   /* to check if D2domain  has been in standby */
#define PWR_FLAG_SB_D1             (0x11U)   /* to check if D1 domain  has been in standby */
#if !defined (CORE_CM0PLUS)
#define PWR_FLAG_SB                (0x15U)   /* to check if system  has been in standby */
#define PWR_FLAG_STOP              (0x16U)   /* to check if system  has been in stop */
#endif /* CORE_CM0PLUS */

/**
  * @}
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup PWR_Exported_Macro PWR Exported Macro
  * @{
  */
/* Check the parameters */
#define IS_NS_RESOURCE(__RESOURCE__)       (                                                 \
    ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_0) || ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_1)|| \
    ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_2) || ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_3)|| \
    ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_4) || ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_5)|| \
    ((__RESOURCE__) == NON_SHAREABLE_RESSOURCE_6))

#if defined (CORTEX_IN_SECURE_STATE)
#define IS_NS_RESOURCE_ATTRIBUTES(__ATTRIBUTES__)   (\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_ATTR_CID_STATIC_SELECT ) == \
                                                      NS_RESOURCE_ATTR_CID_STATIC_SELECT)    ||\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_CID_DISABLE            ) == \
                                                      NS_RESOURCE_CID_DISABLE)               ||\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_ATTR_SEC_SELECT )        == \
                                                      NS_RESOURCE_ATTR_SEC_SELECT)           ||\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_ATTR_PRIV_SELECT)        == \
                                                      NS_RESOURCE_ATTR_PRIV_SELECT)            )
#else
#define IS_NS_RESOURCE_ATTRIBUTES(__ATTRIBUTES__)   (\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_ATTR_CID_STATIC_SELECT ) == \
                                                      NS_RESOURCE_ATTR_CID_STATIC_SELECT)    ||\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_CID_DISABLE            ) == \
                                                      NS_RESOURCE_CID_DISABLE)               ||\
                                                     (((__ATTRIBUTES__) & NS_RESOURCE_ATTR_PRIV_SELECT)        == \
                                                      NS_RESOURCE_ATTR_PRIV_SELECT)            )
#endif /* CORTEX_IN_SECURE_STATE */

#define IS_WIO_RESOURCE(__RESOURCE__)          (                                   \
    ((__RESOURCE__) == WIO_RESOURCE_0) || ((__RESOURCE__) == WIO_RESOURCE_1)|| \
    ((__RESOURCE__) == WIO_RESOURCE_2) || ((__RESOURCE__) == WIO_RESOURCE_3)|| \
    ((__RESOURCE__) == WIO_RESOURCE_4) || ((__RESOURCE__) == WIO_RESOURCE_5)   )

#if defined (CORTEX_IN_SECURE_STATE)
#define IS_WIO_PIN_ATTRIBUTES(__ATTRIBUTES__)   ((((__ATTRIBUTES__) & WIO_PIN_ATTR_CID_SHARED_SELECT ) == \
                                                  WIO_PIN_ATTR_CID_SHARED_SELECT)    ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_ATTR_CID_STATIC_SELECT ) == \
                                                  WIO_PIN_ATTR_CID_STATIC_SELECT)    ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_CID_DISABLE            ) == \
                                                  WIO_PIN_CID_DISABLE)               ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_ATTR_SEC_SELECT )        == \
                                                  WIO_PIN_ATTR_SEC_SELECT)           ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_ATTR_PRIV_SELECT)        == \
                                                  WIO_PIN_ATTR_PRIV_SELECT)            )
#else
#define IS_WIO_PIN_ATTRIBUTES(__ATTRIBUTES__)   ((((__ATTRIBUTES__) & WIO_PIN_ATTR_CID_SHARED_SELECT ) == \
                                                  WIO_PIN_ATTR_CID_SHARED_SELECT)    ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_ATTR_CID_STATIC_SELECT ) == \
                                                  WIO_PIN_ATTR_CID_STATIC_SELECT)    ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_CID_DISABLE            ) == \
                                                  WIO_PIN_CID_DISABLE)               ||\
                                                 (((__ATTRIBUTES__) & WIO_PIN_ATTR_PRIV_SELECT)        == \
                                                  WIO_PIN_ATTR_PRIV_SELECT)            )
#endif /* CORTEX_IN_SECURE_STATE */


#define IS_PWR_ITEMS(__ITEM__)           (IS_WIO_RESOURCE(__ITEM__) || IS_NS_RESOURCE(__ITEM__))


