zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr.h
#if defined(PWR_D3CR_D3RDY)
#define __HAL_PWR_GET_COMMON_FLAG(__FLAG__) ( \
                                              ((__FLAG__) == PWR_FLAG_VDDGPURDY)?((PWR->CR12 & PWR_CR12_VDDGPURDY) \
                                                  == PWR_CR12_VDDGPURDY) :   \
                                              ((__FLAG__) == PWR_FLAG_PVDO)     ?((PWR->CR3  & PWR_CR3_PVDO) \
                                                  == PWR_CR3_PVDO)      :    \
                                              ((__FLAG__) == PWR_FLAG_VBATL)    ?((PWR->CR2  & PWR_CR2_VBATL) \
                                                  == PWR_CR2_VBATL)     :    \
                                              ((__FLAG__) == PWR_FLAG_VBATH)    ?((PWR->CR2  & PWR_CR2_VBATH) \
                                                  == PWR_CR2_VBATH)     :    \
                                              ((__FLAG__) == PWR_FLAG_TEMPL)    ?((PWR->CR2  & PWR_CR2_TEMPL)    \
                                                  == PWR_CR2_TEMPL)     :    \
                                              ((__FLAG__) == PWR_FLAG_TEMPH)    ?((PWR->CR2  & PWR_CR2_TEMPH)  \
                                                  == PWR_CR2_TEMPH)     :    \
                                              ((__FLAG__) == PWR_FLAG_VDDCOREL) ?((PWR->CR5  & PWR_CR5_VCOREL)  \
                                                  == PWR_CR5_VCOREL)    :    \
                                              ((__FLAG__) == PWR_FLAG_VDDCOREH) ?((PWR->CR5  & PWR_CR5_VCOREH)   \
                                                  == PWR_CR5_VCOREH)    :    \
                                              ((__FLAG__) == PWR_FLAG_VDDCPUL)  ?((PWR->CR6  & PWR_CR6_VCPUL) \
                                                  == PWR_CR6_VCPUL)     :    \
                                              ((__FLAG__) == PWR_FLAG_VDDCPUH)  ?((PWR->CR6  & PWR_CR6_VCPUH)   \
                                                  == PWR_CR6_VCPUH)     :    \
                                              ((PWR->D3CR & PWR_D3CR_D3RDY)     == PWR_D3CR_D3RDY))
#else
#define __HAL_PWR_GET_COMMON_FLAG(__FLAG__) ( \
                                              ((__FLAG__) == PWR_FLAG_PVDO)    ?((PWR->CR3  & PWR_CR3_PVDO)  \
                                                  == PWR_CR3_PVDO)      :    \
                                              ((__FLAG__) == PWR_FLAG_VBATL)   ?((PWR->CR2  & PWR_CR2_VBATL) \
                                                  == PWR_CR2_VBATL)     :    \
                                              ((__FLAG__) == PWR_FLAG_VBATH)   ?((PWR->CR2  & PWR_CR2_VBATH) \
                                                  == PWR_CR2_VBATH)     :    \
                                              ((__FLAG__) == PWR_FLAG_TEMPL)   ?((PWR->CR2  & PWR_CR2_TEMPL) \
                                                  == PWR_CR2_TEMPL)     :    \
                                              ((__FLAG__) == PWR_FLAG_TEMPH)   ?((PWR->CR2  & PWR_CR2_TEMPH) \
                                                  == PWR_CR2_TEMPH)     : 0U )
#endif /* defined(PWR_D3CR_D3RDY) */

#if defined(PWR_CPU3CR_VBF)
#if defined (CORE_CA35)
#define __HAL_PWR_GET_FLAG(__FLAG__) ( \
                                       ((__FLAG__) == PWR_FLAG_VB)        ?((PWR->CPU1CR & PWR_CPU1CR_VBF)    \
                                                                            == PWR_CPU1CR_VBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D3)     ?((PWR->CPU1CR & PWR_CPU1CR_SBF_D3)  \
                                                                            == PWR_CPU1CR_SBF_D3) :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D1)     ?((PWR->CPU1CR & PWR_CPU1CR_SBF_D1)  \
                                                                            == PWR_CPU1CR_SBF_D1) :        \
                                       ((__FLAG__) == PWR_FLAG_SB)        ?((PWR->CPU1CR & PWR_CPU1CR_SBF)  \
                                                                            == PWR_CPU1CR_SBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_STOP)      ?((PWR->CPU1CR & PWR_CPU1CR_STOPF)  \
                                                                            == PWR_CPU1CR_STOPF)  :        \
                                       (__HAL_PWR_GET_COMMON_FLAG(__FLAG__)))
#elif defined (CORE_CM33)
#define __HAL_PWR_GET_FLAG(__FLAG__) ( \
                                       ((__FLAG__) == PWR_FLAG_VB)        ?((PWR->CPU2CR & PWR_CPU2CR_VBF)    \
                                                                            == PWR_CPU2CR_VBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D3)     ?((PWR->CPU2CR & PWR_CPU2CR_SBF_D3)  \
                                                                            == PWR_CPU2CR_SBF_D3) :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D2)     ?((PWR->CPU2CR & PWR_CPU2CR_SBF_D2)  \
                                                                            == PWR_CPU2CR_SBF_D2) :        \
                                       ((__FLAG__) == PWR_FLAG_SB)        ?((PWR->CPU2CR & PWR_CPU2CR_SBF)      \
                                                                            == PWR_CPU2CR_SBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_STOP)      ?((PWR->CPU2CR & PWR_CPU2CR_STOPF)    \
                                                                            == PWR_CPU2CR_STOPF)  :        \
                                       (__HAL_PWR_GET_COMMON_FLAG(__FLAG__)))
#elif defined (CORE_CM0PLUS)
#define __HAL_PWR_GET_FLAG(__FLAG__) ( \
                                       ((__FLAG__) == PWR_FLAG_VB)        ?((PWR->CPU3CR & PWR_CPU3CR_VBF)    \
                                                                            == PWR_CPU3CR_VBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D3)     ?((PWR->CPU3CR & PWR_CPU3CR_SBF_D3)  \
                                                                            == PWR_CPU3CR_SBF_D3) :        \
                                       (__HAL_PWR_GET_COMMON_FLAG(__FLAG__)))
#endif /* CORE_CA35 */
#else
#if defined (CORE_CA35)
#define __HAL_PWR_GET_FLAG(__FLAG__) ( \
                                       ((__FLAG__) == PWR_FLAG_VB)        ?((PWR->CPU1CR & PWR_CPU1CR_VBF)    \
                                                                            == PWR_CPU1CR_VBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D1)     ?((PWR->CPU1CR & PWR_CPU1CR_SBF_D1)  \
                                                                            == PWR_CPU1CR_SBF_D1) :        \
                                       ((__FLAG__) == PWR_FLAG_SB)        ?((PWR->CPU1CR & PWR_CPU1CR_SBF) \
                                                                            == PWR_CPU1CR_SBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_STOP)      ?((PWR->CPU1CR & PWR_CPU1CR_STOPF) \
                                                                            == PWR_CPU1CR_STOPF)  :        \
                                       (__HAL_PWR_GET_COMMON_FLAG(__FLAG__)))
#elif defined (CORE_CM33)
#define __HAL_PWR_GET_FLAG(__FLAG__) ( \
                                       ((__FLAG__) == PWR_FLAG_VB)        ?((PWR->CPU2CR & PWR_CPU2CR_VBF)           \
                                                                            == PWR_CPU2CR_VBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_SB_D2)     ?((PWR->CPU2CR & PWR_CPU2CR_SBF_D2)        \
                                                                            == PWR_CPU2CR_SBF_D2) :        \
                                       ((__FLAG__) == PWR_FLAG_SB)        ?((PWR->CPU2CR & PWR_CPU2CR_SBF)           \
                                                                            == PWR_CPU2CR_SBF)    :        \
                                       ((__FLAG__) == PWR_FLAG_STOP)      ?((PWR->CPU2CR & PWR_CPU2CR_STOPF)         \
                                                                            == PWR_CPU2CR_STOPF)  :        \
                                       (__HAL_PWR_GET_COMMON_FLAG(__FLAG__)))
#endif /* CORE_CA35 */
#endif /* defined(PWR_CPU3CR_VBF) */


