zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr.h
/** @brief  Clear  all historic  PWR state flags (e.g. system has been in standby)
  *         on current CPU control register
  * @retval None.
  */
#if defined (CORE_CA35)
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)  SET_BIT(PWR->CPU1CR, PWR_CPU1CR_CSSF)
#elif defined (CORE_CM33)
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)  SET_BIT(PWR->CPU2CR, PWR_CPU2CR_CSSF)
#elif defined (CORE_CM0PLUS)
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)  SET_BIT(PWR->CPU3CR, PWR_CPU3CR_CSSF)
#endif /* CORE_CA35 */

/** @brief  Clear PWR WKUP line status flags
  * @retval None.
  */
#define __HAL_PWR_WKUP_CLEAR_FLAG(__LINE__) \
  SET_BIT(*(&PWR->WKUPCR1 + (__LINE__)*(0x01u)), PWR_WKUPCR1_WKUPC)


/**
  * @brief Enable the PVD  Exti Line.
  * @note Line is connected to Instance 1 of EXTI IP.
  * @note EXT1 event are  connected to M33_NVIC and A35_GIC  but not to M0+_NVIC
  * @retval None.
  */
#if defined(CORE_CM33)
#define __HAL_PWR_PVD_EXTI_ENABLE_IT()  SET_BIT(EXTI1_C2->IMR1, PWR_EXTI_LINE_PVD)
#elif defined (CORE_CA35)
#define __HAL_PWR_PVD_EXTI_ENABLE_IT()  SET_BIT(EXTI1_C1->IMR1, PWR_EXTI_LINE_PVD)
#endif /* CORE_CM33 */


/**
  * @brief Disable the PVD  EXTI Line.
  * @note Line is connected to Instance 1 of EXTI IP.
  * @note EXT1 event are  connected to M33_NVIC and A35_GIC  but not to M0+_NVIC
  * @retval None.
  */
#if defined(CORE_CM33)
#define __HAL_PWR_PVD_EXTI_DISABLE_IT() CLEAR_BIT(EXTI1_C2->IMR1, PWR_EXTI_LINE_PVD)
#elif defined (CORE_CA35)
#define __HAL_PWR_PVD_EXTI_DISABLE_IT() CLEAR_BIT(EXTI1_C1->IMR1, PWR_EXTI_LINE_PVD)
#endif /* CORE_CM33 */

#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief Enable the PVD  Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE()  SET_BIT(EXTI1->RTSR1, PWR_EXTI_LINE_PVD)

/**
  * @brief Disable the PVD  Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE()  CLEAR_BIT(EXTI1->RTSR1, PWR_EXTI_LINE_PVD)


/**
  * @brief Enable the PVD Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE()  SET_BIT(EXTI1->FTSR1, PWR_EXTI_LINE_PVD)

/**
  * @brief Disable the PVD Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE()  CLEAR_BIT(EXTI1->FTSR1, PWR_EXTI_LINE_PVD)


/**
  * @brief  PVD EXTI line configuration: set rising & falling edge trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do { \
    __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE(); \
    __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE(); \
  } while(0);

/**
  * @brief Disable the PVD Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do { \
    __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE(); \
    __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE(); \
  } while(0);

/**
  * @brief Check whether the specified PVD EXTI interrupt flag is set or not.
  * @retval EXTI PVD Line Status.
  */
#define __HAL_PWR_PVD_EXTI_GET_FLAG() \
  (((EXTI1->RPR1 & PWR_EXTI_LINE_PVD) == PWR_EXTI_LINE_PVD) || \
   ((EXTI1->FPR1 & PWR_EXTI_LINE_PVD) == PWR_EXTI_LINE_PVD))

/**
  * @brief Clear the PVD Exti flag.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_CLEAR_FLAG() \
  do { \
    SET_BIT(EXTI1->RPR1, PWR_EXTI_LINE_PVD); \
    SET_BIT(EXTI1->FPR1, PWR_EXTI_LINE_PVD); \
  } while(0);

/**
  * @brief  Generates a Software interrupt on selected EXTI line.
  * @retval None
  */
/* PVD  Event in Bank1 */
#define __HAL_PWR_PVD_EXTI_GENERATE_SWIT() SET_BIT(EXTI1->SWIER1, PWR_EXTI_LINE_PVD )

#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/

/* Include PWR HAL Extension module */
#include "stm32mp2xx_hal_pwr_ex.h"


#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief EXTI line  '52+k' mask is '1 << exti_line#(52+k)_pos' where k in range
  *        from 0 (PWR wakeup line #0)  to 5 (PWR wakeup line #5)
  * @note    for wake-up line 0 mask is '1<<20'  as EXTI line for wake-up line 0 is line 52
  * @note    which position is 20 in EXTI_IMR2
  * @note    for wake-up line 5 mask is '1<<25'  as EXTI line for wake-up line 5 is line 57
  * @note    which position is 25 in EXTI_IMR2
  **/

#define __HAL_WKUP_LINE0_EXTI_MSK                          EXTI1_IMR2_IM52
#define __HAL_WKUP_LINE1_EXTI_MSK                          EXTI1_IMR2_IM53
#define __HAL_WKUP_LINE2_EXTI_MSK                          EXTI1_IMR2_IM54
#define __HAL_WKUP_LINE3_EXTI_MSK                          EXTI1_IMR2_IM55
#define __HAL_WKUP_LINE4_EXTI_MSK                          EXTI1_IMR2_IM56
#define __HAL_WKUP_LINE5_EXTI_MSK                          EXTI1_IMR2_IM57
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/


/**
  * @brief  Enable generation of EXTI interruption from a PWR wake-up line (case M33/A35)
  * @param  __EXTI_MSK__: specifies mask of the EXTI line which associated interruption shall be enable
  *         For M33 or A35 core, this parameter can be one of the following values
  *            @arg __HAL_WKUP_LINE0_EXTI_MSK
  *            @arg __HAL_WKUP_LINE1_EXTI_MSK
  *            @arg __HAL_WKUP_LINE2_EXTI_MSK
  *            @arg __HAL_WKUP_LINE3_EXTI_MSK
  *            @arg __HAL_WKUP_LINE4_EXTI_MSK
  *            @arg __HAL_WKUP_LINE5_EXTI_MSK
  * @retval None
  */
#ifdef CORE_CM33
#define __HAL_WKUP_EXTI_ENABLE_IT(__EXTI_MSK__)          (EXTI1_C2->IMR2 |= (__EXTI_MSK__))
#elif defined(CORE_CA35)
#define __HAL_WKUP_EXTI_ENABLE_IT(__EXTI_MSK__)          (EXTI1_C1->IMR2 |= (__EXTI_MSK__))
#endif /* CORE_CM33 */

/**
  * @brief  Disable generation of EXTI interruption from a PWR wake-up line (case M33/A35)
  * @param  __EXTI_MSK__: specifies mask of the EXTI line which associated interruption shall be disable
  *         For M33 or A35 core, this parameter can be one of the following values
  *            @arg __HAL_WKUP_LINE0_EXTI_MSK
  *            @arg __HAL_WKUP_LINE1_EXTI_MSK
  *            @arg __HAL_WKUP_LINE2_EXTI_MSK
  *            @arg __HAL_WKUP_LINE3_EXTI_MSK
  *            @arg __HAL_WKUP_LINE4_EXTI_MSK
  *            @arg __HAL_WKUP_LINE5_EXTI_MSK
  * @retval None
  */
#ifdef CORE_CM33
#define __HAL_WKUP_EXTI_DISABLE_IT(__EXTI_MSK__)          CLEAR_BIT(EXTI1_C2->IMR2, __EXTI_MSK__)
#elif defined(CORE_CA35)
#define __HAL_WKUP_EXTI_DISABLE_IT(__EXTI_MSK__)          CLEAR_BIT(EXTI1_C1->IMR2, __EXTI_MSK__)
#endif /* CORE_CM33 */


/**
  * @brief  Return interruption state of  EXTI interruption from a PWR wake-up line (case M33/A35)
  * @param  __EXTI_MSK__: specifies mask of the EXTI line which associated interruption shall be disable
  *                            see __HAL_WKUP_XX_EXTI_MSK where XX LINE0 ..LINE5 for M33/A35
  * @retval EXTI interrupt register ANDed with wake-up mask
  */
#ifdef CORE_CM33
#define __HAL_WKUP_EXTI_BIT_IT(__EXTI_MSK__)          READ_BIT(EXTI1_C2->IMR2, __EXTI_MSK__)
#elif defined(CORE_CA35)
#define __HAL_WKUP_EXTI_BIT_IT(__EXTI_MSK__)          READ_BIT(EXTI1_C1->IMR2, __EXTI_MSK__)
#endif /* CORE_CM33 */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
/* Initialization and de-initialization functions *****************************/
#if !defined(CORE_CM0PLUS)
#if defined(PWR_BDCR1_DBD3P)
void HAL_PWR_EnableBkUpD3Access(void);
void HAL_PWR_DisableBkUpD3Access(void);
#else
void HAL_PWR_EnableBkUpAccess(void);
void HAL_PWR_DisableBkUpAccess(void);
#endif /* defined(PWR_BDCR1_DBD3P) */
#else
void HAL_PWR_EnableBkUpAccess(void);
void HAL_PWR_DisableBkUpAccess(void);
#endif /*!defined(CORE_CM0PLUS)*/
/**
  * @}
  */

/* Peripheral Control functions  **********************************************/
/** @defgroup PWR_Exported_Functions_Group2 Peripheral Control functions
  * @{
  */
/* PVD configuration */
void HAL_PWR_ConfigPVD(const PWR_PVDTypeDef *sConfigPVD);
void HAL_PWR_EnablePVD(void);
void HAL_PWR_DisablePVD(void);
uint32_t HAL_PWR_GetPVDRange(void);
void HAL_PWR_PVD_IRQHandler(void);
void HAL_PWR_PVD_EqualHigherCallback(void);
void HAL_PWR_PVD_LowerCallback(void);


