zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr.h
/* WakeUp pins configuration */
#if !defined(CORE_CM0PLUS)
void HAL_PWR_EnableWakeUpPin(uint32_t WakeUpPinPolarity);
void HAL_PWR_DisableWakeUpPin(uint32_t WakeUpPinx);
uint32_t HAL_PWR_IsWakeUpCapable(uint32_t WakeUpPinx);
#endif /* CORE_CM0PLUS */


/* EXTI IT functions associated to  WakeUp pin */
#if !defined(CORE_CM0PLUS)
void HAL_PWR_EnableWakeUpExtiIT(uint32_t WakeUpPinx);
void HAL_PWR_DisableWakeUpExtiIT(uint32_t WakeUpPinx);
uint32_t HAL_PWR_IsWakeUpExtiCapable(uint32_t WakeUpPinx);
#endif /* CORE_CM0PLUS */

/* PWR  configuration for D3 wake-up from non-secure TAMPER when system is in VBAT*/
#if ! defined(CORE_CM0PLUS)
void HAL_PWR_EnableD3WakeUpTamper(void);
void HAL_PWR_DisableD3WakeUpTamper(void);
uint32_t HAL_PWR_IsTamperD3WakeUpCapable(void);
#endif /* CORE_CM0PLUS */


/* power state queries */
uint32_t HAL_PWR_CPU1State(void);
uint32_t HAL_PWR_CPU2State(void);
uint32_t HAL_PWR_CPU3State(void);

uint32_t HAL_PWR_D1State(void);
uint32_t HAL_PWR_D2State(void);
uint32_t HAL_PWR_D3State(void);

uint32_t HAL_PWR_HasD1BeenInStandby(void);
uint32_t HAL_PWR_HasD2BeenInStandby(void);
uint32_t HAL_PWR_HasD3BeenInStandby(void);

uint32_t HAL_PWR_HasSystemBeenInStandby(void);
uint32_t HAL_PWR_HasSystemBeenInVBAT(void);
#if defined(CORE_CM33)||defined(CORE_CA35)
uint32_t HAL_PWR_HasSystemBeenInStop(void);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */

/* Low Power modes entry */
void HAL_PWR_EnterSTOPMode(uint32_t Regulator, uint8_t STOPEntry);
void HAL_PWR_EnterSLEEPMode(__attribute__((unused))uint32_t Regulator, uint8_t SLEEPEntry);
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWR_EnterSTANDBYMode(uint8_t STANDBYType);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */


/**
  * @}
  */

/* Cortex System Control functions  *******************************************/
/** @defgroup PWR_Exported_Functions_Group3 Cortex System Control functions
  * @{
  */
#if defined(CORE_CM33)||defined(CORE_CM0PLUS)
void HAL_PWR_EnableSleepOnExit(void);
void HAL_PWR_DisableSleepOnExit(void);
void HAL_PWR_EnableStopOnExit(uint32_t Regulator);
void HAL_PWR_DisableStopOnExit(void);
void HAL_PWR_EnableSEVOnPend(void);
void HAL_PWR_DisableSEVOnPend(void);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
/**
  * @}
  */

/* Register Access control  functions  *******************************************/
/** @defgroup PWR_Exported_Functions_Group4 Register Access control functions
  * @{
  */
void HAL_PWR_ConfigResourceAttributes(uint16_t Item, uint32_t Attributes);
HAL_StatusTypeDef HAL_PWR_GetConfigResourceAttributes(uint16_t Item, uint32_t *pAttributes);
HAL_StatusTypeDef HAL_PWR_TakeResourceSemaphore(uint16_t Item);
HAL_StatusTypeDef HAL_PWR_ReleaseResourceSemaphore(uint16_t Item);


/**
  * @}
  */

/**
  * @}
  */


/* Private constants ---------------------------------------------------------*/

/** @defgroup PWR_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup  EXTI Lines
  * @{
  */
#define PWR_EXTI_LINE_PVD        EXTI1_IMR1_IM16         /*PVD signal connected on line16 of EXTI*/
#define PWR_EXTI_LINE_PVM        EXTI1_IMR1_IM17         /*PVM signal connected on line17 of EXTI*/
#define PWR_EXTI_LINE_VDDCORED   EXTI2_IMR3_IM65         /*VDD core detection signal connected on line65 of EXTI*/
#define PWR_EXTI_LINE_VDDCPUD    EXTI2_IMR3_IM64         /*VDD cpu  detection signal connected on line64 of EXTI*/
#define PWR_EXTI_LINE_VDDGPUD    EXTI1_IMR1_IM18         /*VDD gpu  detection signal connected on line18 of EXTI*/
#if defined(CORE_CM0PLUS)
#define PWR_EXTI_LINE_NS_TAMPER     EXTI2_IMR1_IM20  /*non secure TAMPER  signal for M0+  connected on line20 of EXTI*/
#endif /* CORE_CM0PLUS */
#if defined(CORE_CM33)
#define PWR_EXTI_LINE_NS_TAMPER     EXTI2_IMR1_IM18  /*non secure TAMPER  signal for M33  connected on line18 of EXTI*/
#define PWR_EXTI_LINE_S_TAMPER      EXTI2_IMR1_IM23  /*    secure TAMPER  signal for M33  connected on line23 of EXTI*/
#endif /* CORE_CM33 */
#if defined(CORE_CA35)
#define PWR_EXTI_LINE_NS_TAMPER     EXTI2_IMR1_IM16  /*non secure TAMPER  signal for A35  connected on line16 of EXTI*/
#define PWR_EXTI_LINE_S_TAMPER      EXTI2_IMR1_IM21  /*secure TAMPER  signal for M33  connected on line21 of EXTI*/
#endif /* CORE_CA35 */

/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_HAL_PWR_H */
